JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
// =============================================================================
// ESP32 SKID-STEER UGV CONTROLLER  v2.3.0
// Hardware : ESP32 DevKit V1
//            FlySky FS-iA10B receiver (iBUS on GPIO16)
//            4× ROBU 24 V 250 W brushed motor controllers
//            4× hub motors (left pair / right pair)
//
// Uncomment to run logic only — no DAC or relay outputs. Safe for desk test.
// =============================================================================
//#define SIMULATION_MODE

#define FW_VERSION "2.3.0"

#include <Arduino.h>
#include <HardwareSerial.h>
#include <esp_task_wdt.h>          // ESP32 hardware watchdog
#include "driver/twai.h"

// Watchdog timeout — if loop() stalls longer than this, ESP32 resets.
#define WDT_TIMEOUT_S  2
#define WDT_TIMEOUT_MS (WDT_TIMEOUT_S * 1000U)

// =============================================================================
// CONFIGURATION — all tuneable values in one place
// =============================================================================

// Loop
const uint16_t LOOP_MS             = 20;      // 50 Hz

// iBUS receiver
const uint8_t  IBUS_GPIO           = 16;
const uint8_t  IBUS_CH             = 10;
const uint16_t IBUS_MIN            = 1000;
const uint16_t IBUS_MAX            = 2000;
const uint16_t IBUS_MID            = 1500;
const uint32_t FAILSAFE_MS         = 500;     // signal-loss → failsafe after this

// CAN (ESP32 built-in TWAI controller + external CAN transceiver)
const gpio_num_t CAN_TX_PIN        = GPIO_NUM_5;
const gpio_num_t CAN_RX_PIN        = GPIO_NUM_4;
const uint32_t CAN_CMD_ID          = 0x101;
const uint32_t CAN_STATUS_ID       = 0x200;
const uint32_t CAN_FAULT_ID        = 0x300;
const uint32_t CAN_TIMEOUT_MS      = 200;
const uint32_t CAN_SEQUENCE_TIMEOUT_MS = 200; // sequence must advance at 50 Hz
const uint16_t CAN_REARM_ZERO_MS   = 400;     // stable zero command before CAN arm
const int16_t  CAN_REARM_ZERO_LIMIT = 25;     // normalized command deadband
const uint8_t  CAN_MAGIC           = 0xA5;
const uint8_t  CAN_MODE_JETSON     = 1;
const uint8_t  CAN_MODE_AUTONOMOUS = 2;

// Channel indices (0-based)
const uint8_t  CH_STEER            = 0;       // CH1  left / right
const uint8_t  CH_DIR              = 1;       // CH2  forward / reverse stick
const uint8_t  CH_THR              = 2;       // CH3  speed
const uint8_t  CH_ARM              = 4;       // CH5  arm switch
const uint8_t  CH_MODE             = 5;       // CH6  manual / Jetson / autonomous

// Deadbands & thresholds
const uint16_t ARM_THRESHOLD       = 1700;    // CH5 above this = armed
const uint16_t MODE_MANUAL_MAX     = 1333;
const uint16_t MODE_JETSON_MAX     = 1666;
const uint16_t MODE_SETTLE_MS      = 100;     // reject transient RC mode changes
const uint16_t STEER_DEADBAND      = 30;      // ±µs around centre
const uint16_t DIR_DEADBAND        = 50;      // ±µs CH2 centre — inside = stop
const uint16_t DIR_ENGAGE          = 250;     // CH2 must exceed this to engage drive
                                              // (prevents turn-stick spillage from
                                              //  accidentally engaging fwd/rev)

// Steering
const float    STEER_SENSITIVITY   = 1.0f;    // 1.0 = full tank-turn effect

// DAC (0 = 0 V, 255 = 3.3 V — tune to your controller's throttle input range)
const uint8_t  DAC_IDLE            = 0;
const uint8_t  DAC_MIN_MOVE        = 150;    // minimum DAC to overcome motor controller dead zone
const uint8_t  DAC_MAX             = 255;

// Throttle ramp (DAC counts per 20 ms tick)
// RAMP_UP controls acceleration smoothness.
// At 50 Hz each tick is 20 ms. DAC range that produces motion is
// DAC_MIN_MOVE(150) → DAC_MAX(255), i.e. 105 usable counts.
//   RAMP_UP = 3  → ~700 ms 0→full  (very smooth, recommended)
//   RAMP_UP = 6  → ~350 ms 0→full  (moderate)
//   RAMP_UP = 60 → ~40 ms  0→full  (original — causes jerks)
// RAMP_DOWN = 255 means the DAC drops to zero instantly on any stop
// command, giving the hard motor cut you want for zero-power requests.
const uint8_t  RAMP_UP             = 3;       // ~700 ms 0→full — smooth acceleration
const uint8_t  RAMP_DOWN           = 255;     // instant stop on zero command

// Direction-change sequencer timings (ms)
const uint16_t SEQ_RAMP_BUDGET     = 150;     // max time to reach zero
const uint16_t SEQ_PRE_RELAY       = 150;     // settle before relay flip
const uint16_t SEQ_POST_RELAY      = 300;     // controller accept time after flip (full drive dir changes)
const uint16_t SEQ_POST_RELAY_SHORT= 100;     // shorter settle for low-mag skid-assist flips (<=30% speed)
const uint16_t SEQ_RAMPUP_TIMEOUT  = 1500;    // hard cap on ramp-up phase
const float    SEQ_SHORT_MAG       = 0.30f;   // target speed <= this uses short post settle

// Arming
const uint16_t ARM_DELAY_MS        = 1500;    // power-lock + controller startup
const uint16_t DISARM_RAMP_MS      = 300;     // max time to idle on disarm

// GPIO
const uint8_t  PIN_DAC_L           = 25;      // left  pair throttle
const uint8_t  PIN_DAC_R           = 26;      // right pair throttle
const uint8_t  PIN_REL_L           = 33;      // left  pair reverse relay
const uint8_t  PIN_REL_R           = 32;      // right pair reverse relay
const uint8_t  RELAY_ON            = HIGH;    // change to LOW for active-low modules

// Motor direction — relay OFF = forward on both sides (relay connected to reverse pin)
const bool     L_FWD_RELAY_ON      = false;
const bool     R_FWD_RELAY_ON      = false;

// Serial
const uint32_t BAUD                = 115200;
const uint16_t DEBUG_MS            = 200;
const uint16_t CAN_STATUS_MS       = 200;
const uint16_t CAN_FAULT_MS        = 500;

// =============================================================================
// TYPES
// =============================================================================

enum State   : uint8_t { S_BOOT, S_DISARMED, S_ARMING, S_ARMED, S_DIR_CHG, S_DISARMING, S_FAILSAFE };
enum Dir     : uint8_t { FWD = 0, REV = 1 };
enum ControlMode : uint8_t { MODE_MANUAL, MODE_JETSON, MODE_AUTONOMOUS, MODE_INVALID };
enum SeqPhase: uint8_t { PH_IDLE, PH_RAMP_DOWN, PH_PRE_RELAY, PH_FLIP, PH_RAMP_UP };

struct RxData {
  uint16_t ch[IBUS_CH];
  bool     ok;
  uint32_t lastMs;
};

struct Inputs {
  float steer;      // −1…+1  (CH1)
  float thr;        // 0…1    (CH3)
  bool  arm;        // CH5
  bool  rev;        // CH2 pulled back  → true = reverse
  bool  ch2Active;  // CH2 out of centre deadband → true = fwd/rev drive enabled
  ControlMode mode;
};

struct Side {
  float    req;     // 0–1 requested speed
  float    cur;     // 0–1 current speed (ramped)
  uint8_t  dac;
  Dir      dir;
  Dir      tgtDir;
  SeqPhase phase;
  uint32_t phMs;
};

