JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
struct CanCommand {
  int16_t left;
  int16_t right;
  bool enable;
  uint8_t mode;
  uint8_t sequence;
  uint32_t lastMs;
  uint32_t lastSequenceMs;
  uint32_t zeroSinceMs;
  bool sequenceStale;
  bool valid;
};

// =============================================================================
// GLOBALS
// =============================================================================

State   g_state    = S_BOOT,  g_prev = S_BOOT;
RxData  g_rx       = {};
Inputs  g_in       = {};
Side    g_L        = {},      g_R    = {};
bool    g_pendL    = false,   g_pendR = false;
bool    g_failsafe = false;
bool    g_canFailsafe = false;
bool    g_canKillLatched = false;
CanCommand g_can = {};
ControlMode g_prevMode = MODE_INVALID;
ControlMode g_modeCandidate = MODE_INVALID;
uint32_t g_armMs = 0, g_disMs = 0, g_dbgMs = 0, g_loopMs = 0;
uint32_t g_modeCandidateMs = 0;
uint32_t g_canStatusMs = 0, g_canFaultMs = 0, g_canHealthMs = 0;

// =============================================================================
// iBUS PARSER  (UART2, 115200 baud, RX-only)
// =============================================================================
namespace IBus {
  static HardwareSerial _ser(2);
  static uint8_t _buf[32], _idx = 0;

  void begin() { _ser.begin(115200, SERIAL_8N1, IBUS_GPIO, -1); }

  static bool csum() {
    uint16_t s = 0;
    for (uint8_t i = 0; i < 30; i++) s += _buf[i];
    return (0xFFFF - s) == (_buf[30] | (uint16_t)_buf[31] << 8);
  }

  void update(RxData &d) {
    while (_ser.available()) {
      uint8_t b = _ser.read();
      if (_idx == 0 && b != 0x20) continue;
      if (_idx == 1 && b != 0x40) { _idx = 0; continue; }
      _buf[_idx++] = b;
      if (_idx == 32) {
        if (csum()) {
          for (uint8_t c = 0; c < IBUS_CH; c++)
            d.ch[c] = _buf[2+c*2] | (uint16_t)_buf[3+c*2] << 8;
          d.ok = true; d.lastMs = millis();
        }
        _idx = 0;
      }
    }
  }
}

// =============================================================================
// CAN RX (ESP32 built-in TWAI, non-blocking)
// =============================================================================
static bool g_canReady = false;

static int16_t canInt16(uint8_t hi, uint8_t lo) {
  return (int16_t)(((uint16_t)hi << 8) | lo);
}

// Forward declaration for recovery use
static void canBegin();
// Defined in the hardware-output section; mode changes may need it sooner.
static void safeAll();

// Recover from BUS-OFF by stopping, uninstalling, and reinitialising TWAI.
// Called automatically when the health check detects BUS-OFF state.
static void canRecover() {
  Serial.println(F("[CAN] BUS-OFF detected — recovering..."));
  g_canReady = false;
  twai_stop();
  twai_driver_uninstall();
  delay(100);
  canBegin();
  Serial.println(g_canReady ? F("[CAN] Recovery OK") : F("[CAN] Recovery FAILED"));
}

// Periodic health check: detect BUS-OFF and recover automatically.
// Also clears a stale TX queue so frames don't back up when Pi is absent.
static void canHealthCheck() {
  if (!g_canReady) return;
  twai_status_info_t st;
  if (twai_get_status_info(&st) != ESP_OK) return;

  // If BUS-OFF, reinitialise the controller
  if (st.state == TWAI_STATE_BUS_OFF) {
    canRecover();
    return;
  }

  // Drain stale TX queue — prevents queue-full blocking when no peer is present
  if (st.msgs_to_tx > 0) {
    twai_clear_transmit_queue();
  }
}

static void canBegin() {
  twai_general_config_t general =
      TWAI_GENERAL_CONFIG_DEFAULT(CAN_TX_PIN, CAN_RX_PIN, TWAI_MODE_NORMAL);
  twai_timing_config_t timing = TWAI_TIMING_CONFIG_500KBITS();
  // The ESP32 only consumes control frames.  Reject all other CAN IDs in
  // hardware so unrelated telemetry cannot fill the TWAI receive queue.
  twai_filter_config_t filter = TWAI_FILTER_CONFIG_ACCEPT_ALL();
  filter.acceptance_code = CAN_CMD_ID << 21;
  filter.acceptance_mask = ~(0x7FFUL << 21);
  filter.single_filter = true;

  if (twai_driver_install(&general, &timing, &filter) == ESP_OK &&
      twai_start() == ESP_OK) {
    g_canReady = true;
    Serial.println(F("[CAN] TWAI started at 500 kbit/s"));
  } else {
    g_canReady = false;
    Serial.println(F("[CAN] TWAI start failed — check transceiver wiring"));
  }
}

static void canUpdate() {
  if (!g_canReady) return;

  twai_message_t message;
  while (twai_receive(&message, 0) == ESP_OK) {
    if (message.identifier != CAN_CMD_ID ||
        message.data_length_code != 8 ||
        message.extd || message.rtr ||
        message.data[7] != CAN_MAGIC) {
      continue;
    }

    int16_t left = canInt16(message.data[0], message.data[1]);
    int16_t right = canInt16(message.data[2], message.data[3]);
    if (left < -1000 || left > 1000 || right < -1000 || right > 1000 ||
        (message.data[5] != CAN_MODE_JETSON &&
         message.data[5] != CAN_MODE_AUTONOMOUS)) {
      continue;
    }

    // The mode switch is an independent safety boundary.  Do not let a
    // command intended for Jetson control drive the vehicle while autonomous
    // mode is selected (or vice versa); a mode mismatch must time out instead.
    uint8_t selectedMode = g_prevMode == MODE_JETSON ? CAN_MODE_JETSON :
                           g_prevMode == MODE_AUTONOMOUS ? CAN_MODE_AUTONOMOUS : 0;
    if (message.data[5] != selectedMode) continue;

    uint32_t now = millis();
    bool sequenceChanged = !g_can.valid || message.data[6] != g_can.sequence;
    g_can.left = left;
    g_can.right = right;
    g_can.enable = message.data[4] != 0;
    g_can.mode = message.data[5];
    g_can.sequence = message.data[6];
    g_can.lastMs = now;
    if (sequenceChanged) g_can.lastSequenceMs = now;
    g_can.valid = true;
    g_can.sequenceStale = false;

    // A fresh remote session must prove it is commanding zero before it can
    // arm.  This prevents a queued/nonzero command from moving the vehicle
    // immediately after recovery, a mode switch, or a remote restart.
    bool zeroCommand = abs(left) <= CAN_REARM_ZERO_LIMIT &&
                       abs(right) <= CAN_REARM_ZERO_LIMIT;
    if (!g_can.enable || !zeroCommand) {
      g_can.zeroSinceMs = 0;
    } else if (g_can.zeroSinceMs == 0) {
      g_can.zeroSinceMs = now;
    }
    // A disabled frame is an explicit remote stop.  It remains effective until
    // a subsequent valid, mode-matched enabled frame deliberately re-arms the
    // channel, rather than being confused with a zero-speed command.
    g_canKillLatched = !g_can.enable;
  }
}

