JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
static void checkCanFailsafe() {
  // In CAN mode, both frame freshness and sequence progress are required.
  // The enable bit in the frame is the operator's arm signal — no RC gating.
  if (g_prevMode == MODE_MANUAL) {
    g_canFailsafe = false;
    g_canKillLatched = false;
    g_can.sequenceStale = false;
    return;
  }
  uint32_t now = millis();
  bool timedOut = !g_can.valid || (now - g_can.lastMs) > CAN_TIMEOUT_MS;
  g_can.sequenceStale = !timedOut &&
                        (now - g_can.lastSequenceMs) > CAN_SEQUENCE_TIMEOUT_MS;
  g_canFailsafe = timedOut || g_can.sequenceStale;
}

static bool canRearmReady() {
  return g_can.zeroSinceMs != 0 &&
         (millis() - g_can.zeroSinceMs) >= CAN_REARM_ZERO_MS;
}

static void handleModeChange() {
  if (g_in.mode != g_modeCandidate) {
    g_modeCandidate = g_in.mode;
    g_modeCandidateMs = millis();
    return;
  }
  if ((millis() - g_modeCandidateMs) < MODE_SETTLE_MS ||
      g_modeCandidate == g_prevMode) return;

  // Never transfer control live between RC, Jetson, and autonomous sources.
  // The operator/source must explicitly arm again after selecting a mode.
  safeAll();
  g_state = S_DISARMED;
  g_can = {};
  g_canFailsafe = false;
  g_canKillLatched = false;
  g_prevMode = g_modeCandidate;
}

// =============================================================================
// CAN MODULE HEALTH CHECK
// Verifies that the TWAI transceiver wired to D5 (TX) and D4 (RX) is present
// and that the controller is operating normally.
//
// Returns true  — driver running, bus not in bus-off / error-passive state,
//                 and TX/RX error counters below warning threshold.
// Returns false — driver not started, or hardware fault detected.
//
// Prints a detailed report to Serial regardless of outcome.
// Safe to call from setup() after canBegin(), or from a maintenance routine.
// =============================================================================

#define CAN_ERR_WARN_THRESHOLD  96   // IEC 11898 warning level is 96 counts

static bool canVerify() {
  Serial.println(F("[CAN] ---- CAN module self-check ----"));
  Serial.printf ("[CAN]   TX pin : GPIO%d (D5)\n", (int)CAN_TX_PIN);
  Serial.printf ("[CAN]   RX pin : GPIO%d (D4)\n", (int)CAN_RX_PIN);

  // 1. Driver must have been started successfully by canBegin().
  if (!g_canReady) {
    Serial.println(F("[CAN]   FAIL — TWAI driver did not start."));
    Serial.println(F("[CAN]          Check wiring: CANH/CANL, 120 Ω termination,"));
    Serial.println(F("[CAN]          and transceiver VCC/GND."));
    Serial.println(F("[CAN] ---- self-check FAILED ----"));
    return false;
  }

  // 2. Query live controller status from the hardware peripheral.
  twai_status_info_t status;
  if (twai_get_status_info(&status) != ESP_OK) {
    Serial.println(F("[CAN]   FAIL — could not read TWAI status register."));
    Serial.println(F("[CAN] ---- self-check FAILED ----"));
    return false;
  }

  // 3. Log the raw status fields for diagnostics.
  Serial.printf("[CAN]   State        : ");
  switch (status.state) {
    case TWAI_STATE_STOPPED:       Serial.println(F("STOPPED"));       break;
    case TWAI_STATE_RUNNING:       Serial.println(F("RUNNING ✓"));     break;
    case TWAI_STATE_BUS_OFF:       Serial.println(F("BUS-OFF ✗"));     break;
    case TWAI_STATE_RECOVERING:    Serial.println(F("RECOVERING"));     break;
    default:                       Serial.println(F("UNKNOWN"));        break;
  }
  Serial.printf("[CAN]   TX err count : %lu%s\n",
                (unsigned long)status.tx_error_counter,
                status.tx_error_counter >= CAN_ERR_WARN_THRESHOLD ? "  ← HIGH" : "");
  Serial.printf("[CAN]   RX err count : %lu%s\n",
                (unsigned long)status.rx_error_counter,
                status.rx_error_counter >= CAN_ERR_WARN_THRESHOLD ? "  ← HIGH" : "");
  Serial.printf("[CAN]   TX queued    : %lu\n", (unsigned long)status.msgs_to_tx);
  Serial.printf("[CAN]   RX queued    : %lu\n", (unsigned long)status.msgs_to_rx);
  Serial.printf("[CAN]   Arb lost     : %lu\n", (unsigned long)status.arb_lost_count);
  Serial.printf("[CAN]   Bus errors   : %lu\n", (unsigned long)status.bus_error_count);

  // 4. Evaluate health criteria.
  bool healthy = true;

  if (status.state == TWAI_STATE_BUS_OFF) {
    Serial.println(F("[CAN]   FAIL — controller is bus-off."));
    Serial.println(F("[CAN]          Likely causes: missing termination resistor,"));
    Serial.println(F("[CAN]          broken CANH/CANL wire, or no other node on bus."));
    healthy = false;
  } else if (status.state != TWAI_STATE_RUNNING) {
    Serial.println(F("[CAN]   WARN — controller is not in RUNNING state."));
    healthy = false;
  }

  if (status.tx_error_counter >= CAN_ERR_WARN_THRESHOLD ||
      status.rx_error_counter >= CAN_ERR_WARN_THRESHOLD) {
    Serial.println(F("[CAN]   WARN — error counter(s) at or above warning threshold."));
    Serial.println(F("[CAN]          Check for missing termination or wiring faults."));
    healthy = false;
  }

  if (status.bus_error_count > 0) {
    Serial.println(F("[CAN]   WARN — bus errors detected since last reset."));
    healthy = false;
  }

  if (healthy) {
    Serial.println(F("[CAN]   OK — CAN module on D5/D4 is connected and operational."));
    Serial.println(F("[CAN] ---- self-check PASSED ----"));
  } else {
    Serial.println(F("[CAN] ---- self-check FAILED ----"));
  }

  return healthy;
}

static bool canSend(uint32_t id, const uint8_t *data) {
  if (!g_canReady) return false;
  twai_message_t message = {};
  message.identifier = id;
  message.data_length_code = 8;
  memcpy(message.data, data, 8);
  return twai_transmit(&message, 0) == ESP_OK;
}

static void canTelemetry() {
  uint32_t now = millis();

  // Run health check every 1 s — recovers from BUS-OFF automatically
  if (now - g_canHealthMs >= 1000) {
    g_canHealthMs = now;
    canHealthCheck();
  }

  if (now - g_canStatusMs >= CAN_STATUS_MS) {
    g_canStatusMs = now;
    uint8_t data[8] = {
      (uint8_t)g_state,
      (uint8_t)g_prevMode,
      g_L.dac,
      g_R.dac,
      (uint8_t)(g_failsafe || g_canFailsafe || g_canKillLatched),
      g_can.sequence,
      (uint8_t)((g_can.valid ? 1 : 0) |
                (g_can.sequenceStale ? 2 : 0) |
                (canRearmReady() ? 4 : 0)),
      CAN_MAGIC
    };
    canSend(CAN_STATUS_ID, data);
  }

  if (now - g_canFaultMs >= CAN_FAULT_MS) {
    g_canFaultMs = now;
    uint8_t data[8] = {
      (uint8_t)(g_canReady ? 0 : 1),
      (uint8_t)(g_canFailsafe ? 1 : 0),
      (uint8_t)(g_failsafe ? 1 : 0),
      (uint8_t)(g_canKillLatched ? 1 : 0),
      (uint8_t)(g_rx.ok ? 0 : 1),
      (uint8_t)(g_can.sequenceStale ? 1 : 0),
      (uint8_t)(canRearmReady() ? 1 : 0),
      CAN_MAGIC
    };
    canSend(CAN_FAULT_ID, data);
  }
}

