JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
// =============================================================================
// HELPERS
// =============================================================================

static float clamp(float v, float lo, float hi) { return v<lo?lo:(v>hi?hi:v); }

static float chanToFloat(uint16_t raw, uint16_t mid, uint16_t db) {
  int16_t off = (int16_t)raw - (int16_t)mid;
  if (abs(off) <= (int16_t)db) return 0.0f;
  float range = (IBUS_MAX - IBUS_MIN) / 2.0f - db;
  return clamp((off > 0 ? 1.0f : -1.0f) * (abs(off) - db) / range, -1.0f, 1.0f);
}

static uint8_t toDac(float s) {
  if (s <= 0.0f) return DAC_IDLE;
  // Remap 0→1 speed to DAC_MIN_MOVE→DAC_MAX so motor controllers always
  // receive enough voltage to overcome their dead zone.
  float mapped = DAC_MIN_MOVE + clamp(s, 0.0f, 1.0f) * (DAC_MAX - DAC_MIN_MOVE);
  return (uint8_t)mapped;
}

static float rampTo(float cur, float tgt, float step) {
  if (cur < tgt) return min(cur+step, tgt);
  if (cur > tgt) return max(cur-step, tgt);
  return tgt;
}

// =============================================================================
// HARDWARE OUTPUT
// =============================================================================

static void wDAC(uint8_t pin, uint8_t v)  {
#ifndef SIMULATION_MODE
  dacWrite(pin, v);
#endif
}

static void wRelay(uint8_t pin, bool on) {
#ifndef SIMULATION_MODE
  digitalWrite(pin, on ? RELAY_ON : (RELAY_ON == HIGH ? LOW : HIGH));
#endif
}

// Resolve logical direction to physical relay state for a given side.
static bool relayFor(bool isLeft, Dir dir) {
  bool fwdOn = isLeft ? L_FWD_RELAY_ON : R_FWD_RELAY_ON;
  return (dir == FWD) ? fwdOn : !fwdOn;
}

static void flushDAC()    { wDAC(PIN_DAC_L, g_L.dac); wDAC(PIN_DAC_R, g_R.dac); }
static void flushRelays() { wRelay(PIN_REL_L, relayFor(true,  g_L.dir));
                            wRelay(PIN_REL_R, relayFor(false, g_R.dir)); }

static void safeAll() {
  g_L = {}; g_R = {};
  g_pendL = g_pendR = false;
  wDAC(PIN_DAC_L, DAC_IDLE); wDAC(PIN_DAC_R, DAC_IDLE);
  wRelay(PIN_REL_L, relayFor(true,  FWD));
  wRelay(PIN_REL_R, relayFor(false, FWD));
}

static void initHW() {
  pinMode(PIN_REL_L,   OUTPUT);
  pinMode(PIN_REL_R,   OUTPUT);
  safeAll();
  IBus::begin();
}

// =============================================================================
// INPUT NORMALISATION
// =============================================================================

static void checkFailsafe() {
  if (g_rx.lastMs == 0) { g_failsafe = false; return; }
  bool lost = (millis() - g_rx.lastMs) > FAILSAFE_MS;
  if (lost != g_failsafe) {
    g_failsafe = lost;
    g_rx.ok = !lost;
    Serial.println(lost ? F("[FS] Lost") : F("[FS] Restored — rearm required"));
  }
}

static void readInputs() {
  IBus::update(g_rx);

  if (!g_rx.ok) { g_in = {}; return; }

  // Clamp all channels to valid iBUS range before use — guards against
  // corrupted frames that pass checksum but contain out-of-range values.
  auto chSafe = [](uint16_t v) -> uint16_t {
    return (v < IBUS_MIN) ? IBUS_MIN : (v > IBUS_MAX) ? IBUS_MAX : v;
  };

  g_in.steer = chanToFloat(chSafe(g_rx.ch[CH_STEER]), IBUS_MID, STEER_DEADBAND);

  float t = (float)(chSafe(g_rx.ch[CH_THR]) - IBUS_MIN) / (IBUS_MAX - IBUS_MIN);
  g_in.thr = (t < 0.02f) ? 0.0f : clamp(t, 0.0f, 1.0f);

  // CH2: three-zone spring-return stick.
  //   Push forward  (> mid + DIR_ENGAGE) → FWD drive enabled
  //   Centre zone   (within DIR_ENGAGE)  → no fwd/rev; tank turn possible via CH1
  //   Pull back     (< mid - DIR_ENGAGE) → REV drive enabled
  // Throttle (CH3) is never touched here — it is always the speed source.
  int16_t d = (int16_t)chSafe(g_rx.ch[CH_DIR]) - IBUS_MID;
  if      (d >  (int16_t)DIR_ENGAGE) { g_in.rev = false; g_in.ch2Active = true;  }
  else if (d < -(int16_t)DIR_ENGAGE) { g_in.rev = true;  g_in.ch2Active = true;  }
  else                               { g_in.rev = false;  g_in.ch2Active = false; }

  g_in.arm = (chSafe(g_rx.ch[CH_ARM]) > ARM_THRESHOLD);

  uint16_t modeRaw = chSafe(g_rx.ch[CH_MODE]);
  if (modeRaw <= MODE_MANUAL_MAX) {
    g_in.mode = MODE_MANUAL;
  } else if (modeRaw <= MODE_JETSON_MAX) {
    g_in.mode = MODE_JETSON;
  } else {
    g_in.mode = MODE_AUTONOMOUS;
  }
}

// =============================================================================
// STEERING MIX
// =============================================================================

static void flagDir(Side &s, bool &pend, Dir want) {
  if (want != s.dir) {
    s.tgtDir = want;
    if (s.phase == PH_IDLE && !pend) pend = true;
  } else if (s.phase == PH_IDLE) {
    s.tgtDir = want;
  }
}

static void mix() {
  float str = g_in.steer * STEER_SENSITIVITY;  // −1 = left, +1 = right  (CH1)
  float thr = g_in.thr;                         // 0–1  from CH3 slider
  float mag = fabsf(str);

  // --------------------------------------------------------------------------
  // Three drive modes determined by CH2 position:
  //
  // CH2 forward  (rev=false, ch2Active=true)  → forward drive + skid steer
  // CH2 reverse  (rev=true,  ch2Active=true)  → reverse drive + skid steer
  // CH2 centre   (ch2Active=false)            → tank turn in place if CH1 active
  //                                             and CH3 > 0, otherwise stop
  //
  // CH3 (throttle slider) is ALWAYS the speed source — nothing moves without it.
  // --------------------------------------------------------------------------

  if (thr < 0.01f) {
    // No throttle → full stop regardless of any other stick
    g_L.req = g_R.req = 0.0f;
    flagDir(g_L, g_pendL, FWD);
    flagDir(g_R, g_pendR, FWD);
    return;
  }

  if (!g_in.ch2Active) {
    // CH2 centred → tank turn mode.
    // CH1 left  (str < 0): left=REV, right=FWD → spins left
    // CH1 right (str > 0): left=FWD, right=REV → spins right
    if (str < -0.02f) {
      g_L.req = thr;  g_R.req = thr;
      flagDir(g_L, g_pendL, REV);
      flagDir(g_R, g_pendR, FWD);
    } else if (str > 0.02f) {
      g_L.req = thr;  g_R.req = thr;
      flagDir(g_L, g_pendL, FWD);
      flagDir(g_R, g_pendR, REV);
    } else {
      g_L.req = g_R.req = 0.0f;
      flagDir(g_L, g_pendL, FWD);
      flagDir(g_R, g_pendR, FWD);
    }
    return;
  }

  // CH2 forward or reverse → skid steer drive.
  Dir   baseDir = g_in.rev ? REV : FWD;
  float inner   = clamp(thr * (1.0f - mag), 0.0f, 1.0f);

  if (str < -0.02f) {
    // Turn LEFT while driving → right is inner (slower), left is outer (faster)
    g_L.req = thr;
    g_R.req = inner;
  } else if (str > 0.02f) {
    // Turn RIGHT while driving → left is inner (slower), right is outer (faster)
    g_L.req = inner;
    g_R.req = thr;
  } else {
    // Straight
    g_L.req = g_R.req = thr;
  }
  flagDir(g_L, g_pendL, baseDir);
  flagDir(g_R, g_pendR, baseDir);
}

