JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
static void mixCan() {
  // Drive purely from CAN enable bit — no RC arm required in CAN mode.
  // enable=0, invalid sequence progress, or no recent frame → stop safely.
  if (!g_can.enable || g_canKillLatched || g_canFailsafe) {
    g_L.req = g_R.req = 0.0f;
    flagDir(g_L, g_pendL, FWD);
    flagDir(g_R, g_pendR, FWD);
    return;
  }

  // Direct left/right mapping — no swap needed.
  float left  = (float)g_can.left  / 1000.0f;
  float right = (float)g_can.right / 1000.0f;

  // Small deadband — ignore tiny values that would cause spurious relay switching
  if (fabsf(left)  < 0.05f) left  = 0.0f;
  if (fabsf(right) < 0.05f) right = 0.0f;

  g_L.req = fabsf(left);
  g_R.req = fabsf(right);
  flagDir(g_L, g_pendL, left  < 0.0f ? REV : FWD);
  flagDir(g_R, g_pendR, right < 0.0f ? REV : FWD);
}

// =============================================================================
// THROTTLE RAMP
// =============================================================================

static void rampSide(Side &s, float tgt) {
  float up = (float)RAMP_UP / (DAC_MAX - DAC_IDLE);
  float dn = (float)RAMP_DOWN / (DAC_MAX - DAC_IDLE);
  bool brakingToZero = (tgt <= 0.0f && tgt < s.cur);
  float step = brakingToZero ? dn : up;
  s.cur = rampTo(s.cur, tgt, step);
  s.dac = toDac(s.cur);
}

static bool rampIdle(Side &s) { rampSide(s, 0.0f); return s.cur <= 0.0f; }

// =============================================================================
// DIRECTION-CHANGE SEQUENCER  (per-side, non-blocking)
// IDLE → RAMP_DOWN → PRE_RELAY → FLIP → RAMP_UP → IDLE
// =============================================================================

static bool runSeq(Side &s, uint8_t pin, bool isLeft, bool &pend) {
  uint32_t now = millis();

  switch (s.phase) {
    case PH_IDLE:
      if (!pend) return true;
      s.phase = PH_RAMP_DOWN; s.phMs = now; pend = false;
      break;

    case PH_RAMP_DOWN:
      if (s.cur <= 0.01f) {
        s.cur = 0.0f; s.dac = DAC_IDLE;
        s.phase = PH_FLIP; s.phMs = 0;
      } else if (rampIdle(s) || (now - s.phMs) > SEQ_RAMP_BUDGET) {
        s.cur = 0.0f; s.dac = DAC_IDLE;
        s.phase = PH_PRE_RELAY; s.phMs = now;
      }
      break;

    case PH_PRE_RELAY:
      if ((now - s.phMs) >= SEQ_PRE_RELAY) { s.phase = PH_FLIP; s.phMs = 0; }
      break;

    case PH_FLIP: {
      if (s.phMs == 0) {
        wRelay(pin, relayFor(isLeft, s.tgtDir));
        s.dir = s.tgtDir; s.phMs = now;
      }
      uint32_t post = (s.req <= SEQ_SHORT_MAG) ? SEQ_POST_RELAY_SHORT : SEQ_POST_RELAY;
      if ((now - s.phMs) >= post) { s.phase = PH_RAMP_UP; s.phMs = now; }
      break;
    }

    case PH_RAMP_UP:
      rampSide(s, s.req);
      if (fabsf(s.cur - s.req) < 0.01f ||
          (now - s.phMs) > SEQ_RAMPUP_TIMEOUT ||
          s.req <= 0.0f) {
        s.phase = PH_IDLE; return true;
      }
      break;

    default: s.phase = PH_IDLE; return true;
  }
  return false;
}

// =============================================================================
// FSM STATE HANDLERS
// =============================================================================

static void onDisarmed() {
  // CAN mode: auto-arm when Pi sends enable=1 — no RC arm needed.
  if (g_prevMode != MODE_MANUAL && g_can.valid && g_can.enable &&
      !g_canKillLatched && !g_canFailsafe && canRearmReady() &&
      (millis() - g_can.lastMs) < CAN_TIMEOUT_MS) {
    Serial.println(F("[FSM] DISARMED → ARMED (CAN enable)"));
    g_state = S_ARMED;
    return;
  }
  // Manual mode: RC arm switch as normal.
  if (g_prevMode == MODE_MANUAL && g_in.arm) {
    Serial.println(F("[FSM] DISARMED → ARMING"));
    g_armMs = millis(); g_state = S_ARMING;
  }
}

static void onArming() {
  if (!g_in.arm) {
    Serial.println(F("[FSM] ARMING aborted → DISARMED"));
    safeAll(); g_state = S_DISARMED;
    return;
  }
  if ((millis() - g_armMs) >= ARM_DELAY_MS) {
    Serial.println(F("[FSM] ARMED")); g_state = S_ARMED;
  }
}

static void onArmed() {
  // In CAN mode: RC arm switch is not required — CAN enable bit is the operator control.
  // In manual mode: RC arm switch disarms as normal.
  if (g_prevMode == MODE_MANUAL && !g_in.arm) {
    Serial.println(F("[FSM] ARMED → DISARMING"));
    g_disMs = millis(); g_state = S_DISARMING; return;
  }

  if (g_prevMode == MODE_MANUAL) {
    mix();
  } else {
    mixCan();
  }

  if (g_pendL || g_pendR || g_L.phase != PH_IDLE || g_R.phase != PH_IDLE) {
    g_state = S_DIR_CHG; return;
  }

  if (g_L.req <= 0.0f && g_R.req <= 0.0f) {
    g_L.cur = g_R.cur = 0.0f;
    g_L.dac = g_R.dac = DAC_IDLE;
  } else {
    rampSide(g_L, g_L.req);
    rampSide(g_R, g_R.req);
  }
  flushDAC(); flushRelays();
}

static void onDirChg() {
  // Do NOT call mix() here — keep the direction targets locked for the full
  // sequence. Calling mix() mid-sequence would overwrite req/tgtDir while
  // relays are switching, causing one side to fire before the other is ready.
  bool ld = runSeq(g_L, PIN_REL_L, true,  g_pendL);
  bool rd = runSeq(g_R, PIN_REL_R, false, g_pendR);

  // Only output DAC once BOTH sides have finished their sequences so motors
  // start together. While waiting, hold DAC at idle.
  if (ld && rd) {
    rampSide(g_L, g_L.req);
    rampSide(g_R, g_R.req);
    flushDAC(); flushRelays();
    g_state = S_ARMED;
  } else {
    // Keep motors off during relay switching
    wDAC(PIN_DAC_L, DAC_IDLE);
    wDAC(PIN_DAC_R, DAC_IDLE);
    flushRelays();
  }
}

static void onDisarming() {
  rampIdle(g_L); rampIdle(g_R); flushDAC();
  if ((g_L.cur <= 0.0f && g_R.cur <= 0.0f) || (millis()-g_disMs) > DISARM_RAMP_MS) {
    safeAll();
    Serial.println(F("[FSM] DISARMED")); g_state = S_DISARMED;
  }
}

static void onFailsafe() {
  // Exit failsafe when the underlying cause clears.
  // RC failsafe: require disarm before re-entry (operator must acknowledge).
  // CAN failsafe/stop: require a fresh, valid enabled frame before re-entry.
  if (g_prevMode == MODE_MANUAL) {
    if (g_failsafe) return;  // RC signal still lost — stay in failsafe
    if (!g_in.arm) {
      Serial.println(F("[FSM] FAILSAFE → DISARMED (RC acknowledged)"));
      g_state = S_DISARMED;
    }
    return;
  }

  if (!g_canFailsafe && !g_canKillLatched) {
    // CAN channel has resumed and was explicitly re-armed.  Return through
    // DISARMED so the normal arming path remains the sole way to drive.
    Serial.println(F("[FSM] FAILSAFE → DISARMED (CAN re-armed)"));
    g_state = S_DISARMED;
  }
}

