JimilDoshi/AGV-Full-Stack/Esp32/ESP32_UGV_Controller_from_Autoware/ESP32_UGV_Controller_from_Autoware.ino
// =============================================================================
// FSM DISPATCHER
// =============================================================================

static void runFSM() {
  if (g_state != g_prev) {
    if (g_state == S_DISARMED || g_state == S_FAILSAFE) {
      safeAll();
    }
    g_prev = g_state;
  }

  switch (g_state) {
    case S_BOOT:     safeAll(); g_state = S_DISARMED; break;
    case S_DISARMED: onDisarmed();  break;
    case S_ARMING:   onArming();    break;
    case S_ARMED:    onArmed();     break;
    case S_DIR_CHG:  onDirChg();    break;
    case S_DISARMING:onDisarming(); break;
    case S_FAILSAFE: onFailsafe();  break;
    default:         g_state = S_FAILSAFE; break;
  }
}

static void applyFailsafe() {
  // RC failsafe only applies in manual mode.
  // In CAN mode, a command timeout or explicit remote stop is a failsafe.
  if (g_prevMode == MODE_MANUAL) {
    if (g_in.arm && g_failsafe && g_state != S_FAILSAFE) {
      g_state = S_FAILSAFE;
    }
  } else {
    // A timeout or explicit disabled frame must interrupt every active state,
    // including a relay direction-change sequence.
    if ((g_canFailsafe || g_canKillLatched) &&
        g_state != S_DISARMED && g_state != S_FAILSAFE) {
      Serial.println(g_canFailsafe ? F("[FSM] CAN timeout → FAILSAFE") :
                                      F("[FSM] CAN stop → FAILSAFE"));
      g_state = S_FAILSAFE;
    }
  }
}

// =============================================================================
// DEBUG OUTPUT
// =============================================================================

static const char* sName(State s) {
  switch(s) {
    case S_BOOT:     return "BOOT";
    case S_DISARMED: return "DISARMED";
    case S_ARMING:   return "ARMING";
    case S_ARMED:    return "ARMED";
    case S_DIR_CHG:  return "DIR_CHG";
    case S_DISARMING:return "DISARMING";
    case S_FAILSAFE: return "FAILSAFE";
    default:         return "?";
  }
}

static const char* phName(SeqPhase p) {
  switch(p) {
    case PH_IDLE:      return "IDLE";
    case PH_RAMP_DOWN: return "RAMP_DN";
    case PH_PRE_RELAY: return "PRE_REL";
    case PH_FLIP:      return "FLIP";
    case PH_RAMP_UP:   return "RAMP_UP";
    default:           return "?";
  }
}

static const char* modeName(ControlMode m) {
  switch(m) {
    case MODE_MANUAL:     return "MANUAL";
    case MODE_JETSON:     return "JETSON";
    case MODE_AUTONOMOUS: return "AUTO";
    default:              return "INVALID";
  }
}

static void dbg() {
  if ((millis() - g_dbgMs) < DEBUG_MS) return;
  g_dbgMs = millis();
  Serial.println(F("--------------------------------------------------"));
  Serial.printf("UGV v" FW_VERSION "  State : %s\n", sName(g_state));
  Serial.printf("RX     : %s  (%lu ms ago)\n", g_rx.ok?"OK":"LOST", millis()-g_rx.lastMs);
  Serial.printf("Mode   : %s  arm=%d\n", modeName(g_prevMode), g_in.arm);
  Serial.printf("Inputs : str=%+.2f  thr=%.2f  rev=%d  ch2=%s\n",
                g_in.steer, g_in.thr, g_in.rev,
                g_in.ch2Active ? (g_in.rev?"REV":"FWD") : "CTR");
  Serial.printf("CAN    : valid=%d  enable=%d  L=%d  R=%d  fs=%s  seq=%s  rearm=%s\n",
                g_can.valid, g_can.enable, g_can.left, g_can.right,
                g_canFailsafe?"ACTIVE":"clear",
                g_can.sequenceStale?"STALE":"ok",
                canRearmReady()?"ready":"zero-hold");
  Serial.printf("LEFT   : %s  req=%.2f  cur=%.2f  dac=%u  ph=%s\n",
                g_L.dir==REV?"REV":"FWD", g_L.req, g_L.cur, g_L.dac, phName(g_L.phase));
  Serial.printf("RIGHT  : %s  req=%.2f  cur=%.2f  dac=%u  ph=%s\n",
                g_R.dir==REV?"REV":"FWD", g_R.req, g_R.cur, g_R.dac, phName(g_R.phase));
  Serial.printf("Relays : L=%s  R=%s  FS=%s\n",
                relayFor(true, g_L.dir) ?"ON":"OFF",
                relayFor(false,g_R.dir) ?"ON":"OFF",
                g_failsafe?"ACTIVE":"clear");
}

// =============================================================================
// ENTRY POINTS
// =============================================================================

void setup() {
#if ESP_IDF_VERSION_MAJOR >= 5
  const esp_task_wdt_config_t wdt_cfg = {
    .timeout_ms = WDT_TIMEOUT_MS,
    .trigger_panic = true,
  };
  esp_task_wdt_init(&wdt_cfg);
#else
  esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
  esp_task_wdt_add(NULL);

  Serial.begin(BAUD); delay(200);
  Serial.println(F("ESP32 UGV v" FW_VERSION));
#ifdef SIMULATION_MODE
  Serial.println(F("*** SIMULATION — no hardware outputs ***"));
#endif

  initHW();
  canBegin();
  canVerify();        // report CAN module health on D5/D4 at startup
  g_loopMs = millis();
}

void loop() {
  // Stable 50 Hz rate — subtract elapsed to prevent drift accumulation.
  uint32_t now = millis();
  if ((now - g_loopMs) < LOOP_MS) return;
  g_loopMs += LOOP_MS;  // advance by fixed period, not by "now"

  esp_task_wdt_reset();  // pat the watchdog — proves we're not stuck

  readInputs();
  checkFailsafe();
  handleModeChange();
  canUpdate();
  checkCanFailsafe();
  applyFailsafe();
  runFSM();
  canTelemetry();
  dbg();
}
